#include <stdio.h>
int main(){
	int a[3][4]={1,3,5,7,9,11,13,15,17,19,21,23};
	printf("%d,%d\n",a,*a);						//0俴忑華硊睿00啋匼華硊
	printf("%d,%d\n",a[0],*(a+0));				//00啋匼華硊
	printf("%d,%d\n",&a[0],&a[0][0]);			//0俴忑華硊睿00啋匼華硊
	printf("%d,%d\n",a[1],a+1);					//10啋匼華硊睿1俴忑華硊
	printf("%d,%d\n",&a[1][0],*(a+1)+0);		//10啋匼華硊
	printf("%d,%d\n",a[2],*(a+2));				//20啋匼華硊
	printf("%d,%d\n",&a[2],a+2);				//2俴忑華硊
	printf("%d,%d\n",a[1][0],*(*(a+1)+0));		//10啋匼硉
	printf("%d,%d\n",*a[2],*(*(a+2)+0));		//20啋匼硉
	return 0;
}
